README polish
